{"class_name": "Sequential", "keras_version": "2.1.6-tf", "config": [{"class_name": "Embedding", "config": {"mask_zero": false, "dtype": "float32", "input_length": 256, "trainable": true, "activity_regularizer": null, "embeddings_regularizer": null, "embeddings_constraint": null, "name": "embedding", "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": 0, "seed": null, "maxval": null, "dtype": "float32"}}, "input_dim": 15000, "output_dim": 64, "batch_input_shape": [null, 256]}}, {"class_name": "Conv1D", "config": {"dtype": "float32", "bias_constraint": null, "dilation_rate": [1], "strides": [1], "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "filters": 32, "name": "conv1d", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}}, "use_bias": true, "kernel_size": [2], "data_format": "channels_last", "kernel_regularizer": null, "activation": "relu", "padding": "valid"}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "dtype": "float32", "trainable": true, "strides": [4], "pool_size": [4], "padding": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout", "noise_shape": null, "dtype": "float32", "rate": 0.4, "trainable": true, "seed": null}}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "name": "global_average_pooling1d", "dtype": "float32"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}}, "units": 512, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "name": "dense", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "noise_shape": null, "dtype": "float32", "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}}, "units": 128, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "noise_shape": null, "dtype": "float32", "rate": 0.25, "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}}, "units": 1, "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_constraint": null, "name": "dense_2", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "activation": "softmax", "kernel_regularizer": null}}], "backend": "tensorflow"}