{"backend": "tensorflow", "config": [{"config": {"embeddings_initializer": {"config": {"maxval": null, "seed": null, "minval": 0, "dtype": "float32"}, "class_name": "RandomUniform"}, "name": "embedding", "output_dim": 128, "mask_zero": false, "input_dim": 15000, "embeddings_regularizer": null, "trainable": true, "activity_regularizer": null, "input_length": 256, "batch_input_shape": [null, 256], "dtype": "float32", "embeddings_constraint": null}, "class_name": "Embedding"}, {"config": {"name": "global_average_pooling1d", "trainable": true, "dtype": "float32"}, "class_name": "GlobalAveragePooling1D"}, {"config": {"activation": "relu", "name": "dense", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 512, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout", "trainable": true, "noise_shape": null, "seed": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 256, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null, "dtype": "float32"}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "dtype": "float32"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "units": 1, "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.6-tf"}